#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: болванка
И я нажимаю на кнопку с именем 'ДобавитьДату'
Когда открылось окно "Выбор дат"
И у поля 'Календарь' я перехожу к дате 28.08.2026
И у поля 'Календарь' я перехожу к дате 28.08.2026
И я нажимаю кнопку выбора у поля с именем 'Календарь'
И я нажимаю на кнопку с именем 'ФормаОК'

И я нажимаю на кнопку с именем 'УдалитьДату'


